app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
  def index
    @tasks = Task.where(user_id: session[:user_id].to_i)

INSERT INTO "tasks" ("title", "description", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "lksajdf"], ["description", "lkasjdf"], ["details", "skdjfh;lksdhf"], ["created_at", "2016-10-04 01:24:09.400622"], ["updated_at", "2016-10-04 01:24:09.400622"]]
UPDATE "tasks" SET "user_id" = ?, "title" = ?, "description" = ?, "details" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["user_id", 1], ["title", "Oh but I have"], ["description", "you don't know me"], ["details", "because I can"], ["updated_at", "2016-11-01 04:48:16.414972"], ["id", 2]]
---
  def create
    @params = params
    @mytask = Task.create
    @mytask.user_id = session[:user_id].to_i
    @mytask.title = params["task"]["title"]
    @mytask.description = params["task"]["description"]
    @mytask.details = params["task"]["details"]
    @mytask.completion_status = params["task"]["completion_status"]
    @mytask.completion_date = params["task"]["completion_date"]
    @mytask.save

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy

    @mytask.destroy

UPDATE "tasks" SET "description" = ?, "completion_status" = ?, "completion_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Health"], ["completion_status", nil], ["completion_date", nil], ["updated_at", "2016-10-05 01:22:45.456203"], ["id", 2]]
---
  def update
    # @params = params
    @mytask.user_id = params["task"]["user_id"].to_i
    @mytask.title = params["task"]["title"]
    @mytask.description = params["task"]["description"]
    @mytask.details = params["task"]["details"]
    @mytask.completion_status = params["task"]["completion_status"]
    @mytask.completion_date = params["task"]["completion_date"]
    @mytask.save

UPDATE "tasks" SET "completion_status" = ?, "completion_date" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completion_status", "t"], ["completion_date", "2016-10-04 15:44:35.780470"], ["updated_at", "2016-10-04 15:44:35.781962"], ["id", 2]]
---
  def mark_complete

    @mytask.completion_status = "true"
    @mytask.completion_date = Time.now
    @mytask.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]
---
  def find_task
    @mytask = Task.find(params[:id].to_i)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_user
    @user = User.find_by(id: session[:user_id].to_i)