app/controllers/users_controller.rb

  def update
    @user.profile_name = params[:user][:profile_name]
    @user.save
---
UPDATE "users" SET "profile_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_name", "AdultBrandi"], ["updated_at", "2016-10-30 19:54:12.206429"], ["id", 1]]

  def find_user
    @user = User.find_by(id: session[:user_id].to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]